Revit 2025 API
ExternalServiceResult Enumeration
 An enumerated value representing a result from executing an external service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ExternalServiceResult
Public Enumeration ExternalServiceResult
public enum class ExternalServiceResult
type ExternalServiceResult
Members
Member name | Value | Description
Succeeded | 0 |  Service has been executed successfully.
Failed | 1 |  Service execution has failed.
Unhandled | 2 |  Execution of a service has not been handled; possibly because there are no applicable servers.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace